app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Important"], ["description", "Important tasks are listed under this category"], ["created_at", "2022-05-02 12:15:25.885473"], ["updated_at", "2022-05-02 12:15:25.885473"]]

  def update
    @category = Category.find(params[:id])
    if @category.update(category_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["description", "Not urgent but important"], ["updated_at", "2022-05-02 12:31:11.526576"], ["id", 2]]