app/controllers/tasks_controller.rb

  def index
    if params[:category_id].present?
      @tasks = @category.tasks
    else
      # @tasks = Task.all
      @tasks = Task.order(params[:sort])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 1], ["id", 1], ["LIMIT", 1]]

  def show
    if params[:category_id].present?
      @task = @category.tasks.find(params[:id])
    else
      @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 3], ["id", 4], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 1], ["id", 1], ["LIMIT", 1]]

  def new
    if params[:category_id].present?
      @task = @category.tasks.build
    else
      @task = Task.new(task_params)
    end
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def edit
    if @category == nil
      @task = Task.find(params[:id])
    else
      @task = @category.tasks.find(params[:id])
    end
    @categories = Category.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 3], ["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def create
    @categories = Category.all
    if @category == nil
      @task = Task.new(task_params)
    else
      @task = @category.tasks.build(task_params)
    end
    if @task.save!
---
SELECT "categories".* FROM "categories"
INSERT INTO "tasks" ("name", "body", "category_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Take a break"], ["body", "Sleep"], ["category_id", 4], ["created_at", "2022-05-04 02:32:19.052307"], ["updated_at", "2022-05-04 02:32:19.052307"], ["user_id", 1]]

  def update
    if params[:category_id].present?
      @task = @category.tasks.find(params[:id])
    else
      @task = Task.find(params[:id])
    end

    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "body" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["body", "Organize shelves"], ["updated_at", "2022-05-04 02:45:05.530144"], ["id", 5]]

  def destroy
    if params[:category_id].present?
      @task = @category.tasks.find(params[:id])
    else
      @task = Task.find(params[:id])
    end
    @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]

  def get_category
    if params[:category_id].present?
      @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]