app/controllers/tasks_controller.rb

  def create
    @task = @category.tasks.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "body", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", nil], ["body", "clean room"], ["category_id", 1], ["created_at", "2022-05-02 17:48:19.310471"], ["updated_at", "2022-05-02 17:48:19.310471"]]

  def update
    @task = @category.tasks.find(params[:id])
    if @task.update(task_params)
---
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "clean room"], ["updated_at", "2022-05-03 17:11:14.916168"], ["id", 5]]

  def destroy
    @task = @category.tasks.find(params[:id])
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]

  def get_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]